fixture/vcr_cassettes/payments_list.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.paypal.com/v1/payments/payment?"
    },
    "response": {
      "body": "{\"payments\":[{\"id\":\"PAY-56X02727YH154025YLEISYVI\",\"intent\":\"sale\",\"state\":\"approved\",\"cart\":\"7MA403949P880733G\",\"payer\":{\"payment_method\":\"paypal\",\"status\":\"UNVERIFIED\",\"payer_info\":{\"email\":\"tedelex06@gmail.com\",\"first_name\":\"Zen\",\"last_name\":\"Savona\",\"payer_id\":\"TM63YY9GU9Q8C\",\"shipping_address\":{\"recipient_name\":\"Brian Robinson\",\"line1\":\"4th Floor\",\"line2\":\"Unit #34\",\"city\":\"San Jose\",\"state\":\"CA\",\"postal_code\":\"95131\",\"country_code\":\"US\"},\"phone\":\"0481854963\",\"country_code\":\"US\"}},\"transactions\":[{\"amount\":{\"total\":\"30.11\",\"currency\":\"USD\",\"details\":{\"subtotal\":\"30.00\",\"tax\":\"0.07\",\"shipping\":\"0.03\",\"insurance\":\"0.01\",\"handling_fee\":\"1.00\",\"shipping_discount\":\"-1.00\"}},\"payee\":{\"merchant_id\":\"G8Z6LP4WN9SP4\"},\"description\":\"The payment transaction description.\",\"custom\":\"EBAY_EMS_90048630024435\",\"invoice_number\":\"48787589673\",\"soft_descriptor\":\"PAYPAL *TESTFACILIT ECHI5786786\",\"item_list\":{\"items\":[{\"name\":\"hat\",\"sku\":\"1\",\"description\":\"Brown hat.\",\"price\":\"3.00\",\"currency\":\"USD\",\"tax\":\"0.01\",\"quantity\":5},{\"name\":\"handbag\",\"sku\":\"product34\",\"description\":\"Black handbag.\",\"price\":\"15.00\",\"currency\":\"USD\",\"tax\":\"0.02\",\"quantity\":1}],\"shipping_address\":{\"recipient_name\":\"Brian Robinson\",\"line1\":\"4th Floor\",\"line2\":\"Unit #34\",\"city\":\"San Jose\",\"state\":\"CA\",\"postal_code\":\"95131\",\"country_code\":\"US\"}},\"related_resources\":[{\"sale\":{\"id\":\"7UB09546JJ671102D\",\"state\":\"completed\",\"amount\":{\"total\":\"30.11\",\"currency\":\"USD\",\"details\":{\"subtotal\":\"30.00\",\"tax\":\"0.07\",\"shipping\":\"0.03\",\"insurance\":\"0.01\",\"handling_fee\":\"1.00\",\"shipping_discount\":\"-1.00\"}},\"payment_mode\":\"INSTANT_TRANSFER\",\"protection_eligibility\":\"ELIGIBLE\",\"protection_eligibility_type\":\"ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE\",\"transaction_fee\":{\"value\":\"1.32\",\"currency\":\"USD\"},\"parent_payment\":\"PAY-56X02727YH154025YLEISYVI\",\"create_time\":\"2017-05-09T02:54:14Z\",\"update_time\":\"2017-05-09T02:54:14Z\",\"links\":[{\"href\":\"https://api.sandbox.paypal.com/v1/payments/sale/7UB09546JJ671102D\",\"rel\":\"self\",\"method\":\"GET\"},{\"href\":\"https://api.sandbox.paypal.com/v1/payments/sale/7UB09546JJ671102D/refund\",\"rel\":\"refund\",\"method\":\"POST\"},{\"href\":\"https://api.sandbox.paypal.com/v1/payments/payment/PAY-56X02727YH154025YLEISYVI\",\"rel\":\"parent_payment\",\"method\":\"GET\"}],\"soft_descriptor\":\"PAYPAL *TESTFACILIT ECHI5786786\"}}]}],\"create_time\":\"2017-05-09T02:54:14Z\",\"links\":[{\"href\":\"https://api.sandbox.paypal.com/v1/payments/payment/PAY-56X02727YH154025YLEISYVI\",\"rel\":\"self\",\"method\":\"GET\"}]}],\"count\":1}",
      "headers": {
        "Date": "Tue, 09 May 2017 03:10:01 GMT",
        "Server": "Apache",
        "Content-Language": "*",
        "Vary": "Authorization",
        "Content-Length": "2498",
        "Connection": "close",
        "Content-Type": "application/json"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]